# DATETIME FUNCTION

In [1]:
import mysql.connector as connector
connection = connector.connect(user="root",password="",host="127.0.0.1")
cursor = connection.cursor()
cursor.execute("USE little_lemon")

In [2]:
## datetime functions 
import datetime as dt
current_time = dt.datetime.now() #Year-Month-Day Hour:Munite:Second
print(current_time)
print(current_time.date())
print(current_time.time())

## find the difference of time is time delta
## whats was the date after one week
week = dt.timedelta(days=7)
print(week)

date_after_1_week = current_time.date()+week
print(date_after_1_week)
date_after_1_week = current_time+week
print(date_after_1_week)

2023-01-06 09:32:50.582986
2023-01-06
09:32:50.582986
7 days, 0:00:00
2023-01-13
2023-01-13 09:32:50.582986

In [3]:
## changing the booking slot to 1 hour 
query1 = """SELECT * FROM bookings;"""
cursor.execute(query1)

In [4]:
col = cursor.column_names
print(col)

('BookingID', 'TableNo', 'GuestFirstName', 'GuestLastName', 'BookingSlot', 'EmployeeID')

In [5]:
results = cursor.fetchall()

In [6]:
for item in results:
    print(item)

(1, 12, 'Anna', 'Iversen', datetime.timedelta(seconds=68400), 1)
(2, 11, 'Joakim', 'Iversen', datetime.timedelta(seconds=68400), 6)
(3, 19, 'Vanessa', 'McCarthy', datetime.timedelta(seconds=54000), 3)
(4, 15, 'Marcos', 'Romero', datetime.timedelta(seconds=63000), 4)
(5, 5, 'Hiroki', 'Yamane', datetime.timedelta(seconds=66600), 2)
(6, 10, 'Diana', 'Pinto', datetime.timedelta(seconds=72000), 5)

In [7]:
for result in results:
    booking_id       = result[0]
    booking_slot     = result[4]
    new_booking_slot = booking_slot+dt.timedelta(hours=1)
    print("BookingID {} is moved from {} to {}".format(booking_id,booking_slot,new_booking_slot))

BookingID 1 is moved from 19:00:00 to 20:00:00
BookingID 2 is moved from 19:00:00 to 20:00:00
BookingID 3 is moved from 15:00:00 to 16:00:00
BookingID 4 is moved from 17:30:00 to 18:30:00
BookingID 5 is moved from 18:30:00 to 19:30:00
BookingID 6 is moved from 20:00:00 to 21:00:00

In [8]:
## total amount of different order
sql_query2 = """SELECT SUM(BillAmount) AS Total_Sale FROM orders;"""
print(sql_query2)

SELECT SUM(BillAmount) AS Total_Sale FROM orders;

In [9]:
cursor.execute(sql_query2)
col = cursor.column_names
data = cursor.fetchall()
print(col)
for item in data:
    print(item)

('Total_Sale',)
(Decimal('243'),)

In [10]:
sql_query3 = """SELECT BookingSlot AS Slot FROM bookings;"""
print(sql_query3)

SELECT BookingSlot AS Slot FROM bookings;

In [11]:
cursor.execute(sql_query3)
col = cursor.column_names
data = cursor.fetchall()
print(col)
for item in data:
    print(item[0])

('Slot',)
19:00:00
19:00:00
15:00:00
17:30:00
18:30:00
20:00:00

In [12]:
sql_query4 = """SELECT HOUR(BookingSlot) AS HOUR_SLOT FROM bookings;"""
print(sql_query4)

SELECT HOUR(BookingSlot) AS HOUR_SLOT FROM bookings;

In [13]:
cursor.execute(sql_query4)
col = cursor.column_names
data = cursor.fetchall()
print(col)
for item in data:
    print(item[0])

('HOUR_SLOT',)
19
19
15
17
18
20

# TASK 1
Along with the booking ID, little lemon needs to add the full name of the guests in upper case on their invoices. Help little lemon to extract the data in the required format.
TIP: Target GuestFistName, GuestLastName and combine them to get GuestFullName.

In [14]:
sql_query5 = """SELECT BookingID AS ID,CONCAT(GuestFirstName," ",GuestLastName) AS GuestFullName FROM bookings;"""
print(sql_query5)

SELECT BookingID AS ID,CONCAT(GuestFirstName," ",GuestLastName) AS GuestFullName FROM bookings;

In [15]:
cursor.execute(sql_query5)

In [16]:
col  = cursor.column_names
data = cursor.fetchall()
print(col)
for item in data:
    print(item)

('ID', 'GuestFullName')
(1, 'Anna Iversen')
(2, 'Joakim Iversen')
(3, 'Vanessa McCarthy')
(4, 'Marcos Romero')
(5, 'Hiroki Yamane')
(6, 'Diana Pinto')

# TASK 2

Task 2:
Little lemon needs to know the following statistics at closing:

Number of bookings

Total sale

Average sale

Help little lemon to compute the required statistics from the data in the Orders table using python.

In [19]:
sql_query5 = """SELECT COUNT(BookingID),SUM(BillAmount),AVG(BillAmount) FROM orders"""
print(sql_query5)

SELECT COUNT(BookingID),SUM(BillAmount),AVG(BillAmount) FROM orders

In [23]:
cursor.execute(sql_query5)
col = cursor.column_names
data = cursor.fetchall()
print("Todays Statistics")
for item in data:
    print("NUMBER OF BOOKING : {}".format(item[0]))
    print("TOTAL SALE : {}".format(item[1]))
    print("Everage SALE : {}".format(item[2]))

Todays Statistics
NUMBER OF BOOKING : 5
TOTAL SALE : 243
Everage SALE : 48.6000

-- Select it group by name

-- how many phone number 

-- does 4 people has

SELECT Count(PhoneNumber),FullName FROM Customers GROUP BY FullName;

-- remember when agragate function and normal row

-- are in a select statement there will be a group by statement

-- to break the full result into subsets

-- it must happen



-- HAVING CLAUSE IS LIKE A WHERE CALUSE

-- BUT IT ONLY OPERATES ON THE GROUP BY

-- FILTER THE GROUP BY IS THE JOB OF HAVING CLAUSE

In [31]:
# REMEMBER GROUP BY STATEMENT WILL BREAK THE RESULT INTO SUBSET
# IF IN A SELECT STATEMENT THERE IS AGGRAGATE FUNCTION AND A NORMAL PROPERTY
# THEN THERE WILL BE MUST A GROUP BY STATEMENT ON THAT PROPERTY
sql_query6 = """SELECT TableNo AS TableNumber,COUNT(TableNo) AS n_booking FROM bookings
                GROUP BY TableNo ORDER BY n_booking DESC;"""
print(sql_query6)

SELECT TableNo AS TableNumber,COUNT(TableNo) AS n_booking FROM bookings
                GROUP BY TableNo ORDER BY n_booking DESC;

In [32]:
cursor.execute(sql_query6)
col = cursor.column_names
data = cursor.fetchall()
print(col)
for item in data:
    print(item)

('TableNumber', 'n_booking')
(11, 1)
(19, 1)
(15, 1)
(5, 1)
(10, 1)
(12, 1)

# TASK 3

Little lemon wants to create three arrival slots for the guests based on the booking hour:

Late afternoon: for hours 15 and 16 

Evening: for hours 17 and 18

Night: for hours 19 and 20

Help little lemon to create the above slots and display the booking ID, guest name, and arrival slot on the kitchen screen so that the staff can plan accordingly. 


TIP: Target GuestFirstName and GuestLastName columns and combine them to get Guest_Name. Use the MySQL CASE function and create Arrival_slot for each guest.

In [42]:
sql_query7 = """SELECT BookingID as BookingID,CONCAT(GuestFirstName,' ',GuestLastName) AS GuestName,
                CASE
                    WHEN HOUR(BookingSlot) IN(15,16) THEN "Late Afternoon"
                    WHEN HOUR(BookingSlot) IN(17,18) THEN "Evening"
                    WHEN HOUR(BookingSlot) IN(19,20) THEN "Night"
                    ELSE "Time Is Not Available"
                END AS Arrival_slot
                FROM Bookings;"""
cursor.execute(sql_query7)
col = cursor.column_names
data = cursor.fetchall()
print(col)
for item in data:
    print(item)

('BookingID', 'GuestName', 'Arrival_slot')
(1, 'Anna Iversen', 'Night')
(2, 'Joakim Iversen', 'Night')
(3, 'Vanessa McCarthy', 'Late Afternoon')
(4, 'Marcos Romero', 'Evening')
(5, 'Hiroki Yamane', 'Evening')
(6, 'Diana Pinto', 'Night')